{
  "backend/main.mo": "Main Motoko canister defining product, enquiry, feedback, message, user profile types, storage maps, authorization helpers, and comparison utilities for sorting.",
  "backend/migration.mo": "Migration module transforming old actor state to new format, mainly updating admin passkey while preserving stored maps and settings.",
  "feature_evidence.json": "Feature evidence report listing frontend files and components involved in admin passkey UI updates and passkey‑only verification changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing UI pages, components, hooks, and admin functionality.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables, dark mode overrides, and base element styling.",
  "frontend/index.html": "HTML entry point with metadata, favicon, and mounting point for the React application.",
  "frontend/src/App.tsx": "Sets up TanStack router, theme provider, and all public and admin routes with admin route guarding.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling login state, error recovery, and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, quick links, contact info, and a credits section.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides the main page layout with navigation, footer, WhatsApp button, and profile setup modal.",
  "frontend/src/components/layout/TopNav.tsx": "Implements the top navigation bar with responsive menus, links, and a login button.",
  "frontend/src/components/whatsapp/WhatsAppFloatingButton.tsx": "Shows a floating WhatsApp contact button using site settings for phone and prefilled message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks for admin checks, passkey verification, and fetching or saving the caller’s user profile.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity context.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching and mutation hooks for products, enquiries, feedback, messages, and site settings using the backend actor.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme color variables and base utility styles.",
  "frontend/src/main.tsx": "Entry point that initializes React, sets up React Query and Internet Identity provider, and renders the main App component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabbed navigation for managing products, enquiries, and settings.",
  "frontend/src/pages/admin/AdminEnquiriesPage.tsx": "Renders the admin enquiries panel.",
  "frontend/src/pages/admin/AdminEnquiriesPanel.tsx": "Fetches and displays all enquiries in a table with customer details and order info.",
  "frontend/src/pages/admin/AdminFeedbackPage.tsx": "Shows all customer feedback submissions in a table with loading and empty states.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Admin layout that renders navigation and routes to products, enquiries, feedback, or messages pages.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Displays contact form messages in a table with loading and empty states.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Renders the admin products panel.",
  "frontend/src/pages/admin/AdminProductsPanel.tsx": "Manages products with listing and a dialog for adding new items including photo upload.",
  "frontend/src/pages/admin/AdminRouteGuard.tsx": "Protects admin routes with authentication, admin checks, and optional passkey verification.",
  "frontend/src/pages/admin/AdminSettingsPanel.tsx": "Admin panel component for editing site settings including certifications, contact info, WhatsApp config, Google Maps embed, and pricing table.",
  "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx": "UI card that prompts the user for an admin passkey and triggers verification with error handling.",
  "frontend/src/pages/AdvantagesPage.tsx": "Displays a grid of HDPE pipe advantages with icons and descriptions, setting the page title on load.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with fields, validation, mock submission handling, and company contact info.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero, features, about section, and navigation buttons, setting the document title on load.",
  "frontend/src/pages/OrderEnquiryPage.tsx": "Order/enquiry form allowing users to submit pipe orders or quotes with validation, file upload, and submission handling.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays product listings with images, details, loading skeletons, and availability indicators.",
  "frontend/src/pages/UsesApplicationsPage.tsx": "Displays a list of HDPE pipe applications with icons and descriptions using cards.",
  "frontend/src/utils/adminCredentials.ts": "Empty utility file placeholder for admin credential helpers.",
  "frontend/src/utils/adminSession.ts": "Utility for storing and managing admin unlock state and passkey in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers to read, persist, and clear URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing admin passkey-only authentication changes and known issues."
}