{
  "backend/main.mo": "Motoko canister defining product, enquiry, feedback, message, and settings types with map-based storage plus access-control-protected profile and admin data operations.",
  "feature_evidence.json": "Feature evidence report listing frontend files involved in admin unlock flow, backend authorization fixes, and React Query refresh behavior.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, their purposes, and their roles in routing, queries, UI, and admin logic.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color tokens for light and dark themes and applying base layout variables.",
  "frontend/index.html": "HTML entry point containing root div, metadata, favicon, and script loader for the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes including guarded admin pages and wraps the app with theme and toaster providers.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button that clears admin session and query cache on logout and handles login edge cases.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without profiles to submit their name via backend save logic.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, quick links, contact info, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the app with top navigation, footer, floating WhatsApp button, and profile modal around routed content.",
  "frontend/src/components/layout/TopNav.tsx": "Renders a responsive navigation bar with links, logo, login button, and mobile menu toggle.",
  "frontend/src/components/whatsapp/WhatsAppFloatingButton.tsx": "Displays a floating WhatsApp contact button using site settings to build a prefilled chat link.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Provides polling logic to detect when the authenticated actor is ready, with both hook and promise APIs.",
  "frontend/src/hooks/useAdminSession.ts": "Tracks reactive admin session unlock state using a subscription to adminSession.",
  "frontend/src/hooks/useAuthz.ts": "Handles admin auth checks, passkey verification, and user profile queries using the actor and admin session.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context for login, identity persistence, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching and mutation hooks for products, enquiries, messages, feedback, and site settings using the actor.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables for light/dark themes, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers and renders the root component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabbed panels for products, enquiries, and settings.",
  "frontend/src/pages/admin/AdminEnquiriesPage.tsx": "Wrapper page that renders the admin enquiries panel.",
  "frontend/src/pages/admin/AdminEnquiriesPanel.tsx": "Displays all enquiries with actions to confirm or reject them, including dialogs and status handling.",
  "frontend/src/pages/admin/AdminFeedbackPage.tsx": "Fetches and lists customer feedback entries with loading, error, and empty states.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Provides the admin dashboard layout, navigation, and routing between admin pages with logout handling.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin passkey verification and redirects authenticated users to their intended admin route.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Shows all submitted contact messages with error, loading, and empty-state logic.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Wrapper component that renders the products management panel.",
  "frontend/src/pages/admin/AdminProductsPanel.tsx": "Allows admins to view products and add new ones through a form with file upload and validation.",
  "frontend/src/pages/admin/AdminRouteGuard.tsx": "Protects admin routes by redirecting locked users to login and preserving the return path.",
  "frontend/src/pages/admin/AdminSettingsPanel.tsx": "Renders the admin settings form, loads existing site settings, allows editing fields, parses pricing table text, and saves updates via mutation.",
  "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx": "Displays a passkey prompt for admin unlock, handles form submission, validation, and error display.",
  "frontend/src/pages/AdvantagesPage.tsx": "Displays a list of HDPE pipe advantages using cards and sets the page title.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form that submits messages via API and shows company contact info.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with hero section, features, about info, and navigation CTAs.",
  "frontend/src/pages/OrderEnquiryPage.tsx": "Provides an order/enquiry form with validation, file upload, and submission handling.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays product listings with details, availability, and optional certifications.",
  "frontend/src/pages/UsesApplicationsPage.tsx": "Lists various applications of HDPE pipes using card-style sections.",
  "frontend/src/utils/adminCredentials.ts": "Defines a static admin passkey and provides a function to verify a given passkey.",
  "frontend/src/utils/adminReturnPath.ts": "Stores, retrieves, and clears the admin return path in sessionStorage.",
  "frontend/src/utils/adminSession.ts": "Manages the admin unlocked session flag, provides logout and clear functions, and dispatches session change events.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme, colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing admin login issues, existing features, and required fixes related to admin session unlocking."
}