{
  "backend/main.mo": "Motoko backend defining data models, storage maps, compare helpers, site settings, and user/admin authorization via mixins.",
  "feature_evidence.json": "Report listing feature implementations, associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file providing short explanations of various frontend files and their purposes.",
  "frontend/DEPLOYMENT.md": "Deployment guide describing prechecks, steps, troubleshooting, and validation for Version 24.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light/dark themes and global styling.",
  "frontend/index.html": "HTML entry point including metadata, favicon, root div, and script to start the React app.",
  "frontend/src/App.tsx": "Defines the app router, page routes including admin guard routes, theme provider, and toaster setup.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity, clearing admin session and query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without profiles to enter their name and save their profile.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with logo, quick links, contact info, and a caffeine.ai credit section.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the app layout with navigation, footer, WhatsApp button, and handles actor connectivity warnings.",
  "frontend/src/components/layout/TopNav.tsx": "Displays the top navigation bar with logo, desktop and mobile menus, and login button.",
  "frontend/src/components/whatsapp/WhatsAppFloatingButton.tsx": "Creates a floating WhatsApp contact button using site settings for phone number and message.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useActorReady.ts": "Provides hooks and utilities to wait for actor readiness with polling and timeout handling.",
  "frontend/src/hooks/useAdminSession.ts": "Tracks and exposes reactive admin session unlock state.",
  "frontend/src/hooks/useAuthz.ts": "Contains admin auth logic, passkey verification, user profile queries, and backend admin authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for managing login state, identity loading, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for products, enquiries, messages, site settings, and order submissions, including mutations and error handling.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables for light/dark modes, and base styling utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with tab-based navigation for managing products, enquiries, and settings.",
  "frontend/src/pages/admin/AdminEnquiriesPage.tsx": "Wrapper page that renders the admin enquiries panel.",
  "frontend/src/pages/admin/AdminEnquiriesPanel.tsx": "Fetches and displays enquiries in a table with confirm and reject actions and related dialogs.",
  "frontend/src/pages/admin/AdminFeedbackPage.tsx": "Fetches and displays customer feedback in a table with loading and error states.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Provides the admin layout, navigation, logout handling, and routing to product, enquiry, feedback, and message pages.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin passkey verification and redirects to the requested admin page after successful login.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Fetches and displays contact form messages in a table with loading and error states.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Wrapper page that renders the admin products panel.",
  "frontend/src/pages/admin/AdminProductsPanel.tsx": "Admin interface for listing products and adding new ones with image upload and form validation.",
  "frontend/src/pages/admin/AdminRouteGuard.tsx": "Guards admin routes by checking session unlock status and redirecting to login if needed.",
  "frontend/src/pages/admin/AdminSettingsPanel.tsx": "Admin panel for viewing and updating site-wide settings including contact info, WhatsApp config, and pricing table.",
  "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx": "UI component that requires Internet Identity login and an admin passkey before granting access.",
  "frontend/src/pages/AdvantagesPage.tsx": "Displays a grid of HDPE pipe advantages with icons and descriptive text.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form that sends messages via backend hooks and displays company contact details.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero, features, about, and navigation call‑to‑action sections.",
  "frontend/src/pages/OrderEnquiryPage.tsx": "Handles order and enquiry submissions with validation, file upload, price lookup, and backend integration.",
  "frontend/src/pages/ProductsPage.tsx": "Displays all products fetched from the backend with loading skeletons and product cards including availability and specifications.",
  "frontend/src/pages/UsesApplicationsPage.tsx": "Shows a static grid of HDPE pipe application cards with icons and descriptions.",
  "frontend/src/utils/adminCredentials.ts": "Stores and verifies the frontend-only admin passkey constant.",
  "frontend/src/utils/adminReturnPath.ts": "Manages storing and retrieving the admin return path in sessionStorage.",
  "frontend/src/utils/adminSession.ts": "Controls admin unlock state in sessionStorage and notifies listeners of session changes.",
  "frontend/src/utils/buildInfo.ts": "Defines build metadata and provides a helper to log version and environment info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL or session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, colors, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project state describing an app with a hard‑coded admin passkey, a regression blocking admin access, and feature requests to restore full admin rights."
}