{
  "backend/main.mo": "Motoko canister defining product, enquiry, feedback, message, and settings types with map-based storage plus authorization and blob-storage mixins.",
  "backend/migration.mo": "Migration module converting old admin-passkey fields to an empty new actor state.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for build reference.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables for light/dark themes and base styles.",
  "frontend/index.html": "HTML entry point loading the React app with metadata and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all public and guarded admin routes wrapped in ThemeProvider.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state and query cache reset.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying branding, quick links, contact info, and attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, footer, routed content, WhatsApp button, and profile setup modal.",
  "frontend/src/components/layout/TopNav.tsx": "Renders a responsive navigation bar with links, logo, login button, and mobile menu toggle.",
  "frontend/src/components/whatsapp/WhatsAppFloatingButton.tsx": "Shows a floating WhatsApp button based on site settings, linking to a prefilled chat.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides admin session checks, passkey verification, and user profile fetch/save hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for products, enquiries, feedback, messages, and related mutations using the actor.",
  "frontend/src/index.css": "Defines Tailwind setup and custom CSS variables for light/dark themes and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabbed panels for managing products, enquiries, and site settings.",
  "frontend/src/pages/admin/AdminEnquiriesPage.tsx": "Standalone page that renders the admin enquiries panel.",
  "frontend/src/pages/admin/AdminEnquiriesPanel.tsx": "Displays all enquiries with actions to confirm or reject them using mutation hooks and confirmation dialogs.",
  "frontend/src/pages/admin/AdminFeedbackPage.tsx": "Fetches and lists all customer feedback submissions in a table with loading and empty states.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Provides the admin dashboard layout, navigation tabs, logout handling, and routing to admin subpages.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Shows all contact form messages in a table with loading and no-data fallback.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Wrapper that renders the main products management panel.",
  "frontend/src/pages/admin/AdminProductsPanel.tsx": "Manages product listing and creation, including a form dialog with file upload and product submission.",
  "frontend/src/pages/admin/AdminRouteGuard.tsx": "Protects admin routes by requiring passkey verification before rendering admin content.",
  "frontend/src/pages/admin/AdminSettingsPanel.tsx": "Loads and edits site-wide settings including contact info, WhatsApp config, certifications, and pricing table.",
  "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx": "React UI component prompting for an admin passkey, handling submission, error display, and verify state.",
  "frontend/src/pages/AdvantagesPage.tsx": "Displays a grid of HDPE pipe advantages with icons and page title setup.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form that validates input, submits messages via API, and displays company contact details.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, feature highlights, company info, and navigation CTAs.",
  "frontend/src/pages/OrderEnquiryPage.tsx": "Provides an order/enquiry form with validation, file upload support, and submission handling for quotes or orders.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays product listings with images, details, availability status, and loading skeletons.",
  "frontend/src/pages/UsesApplicationsPage.tsx": "Shows various applications of HDPE pipes using icon-based cards and descriptive text.",
  "frontend/src/utils/adminCredentials.ts": "Empty file placeholder for admin credential utilities.",
  "frontend/src/utils/adminSession.ts": "Manages admin session state in sessionStorage, including passkey storage, unlock state, logout, and change notifications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and clearing them from URL/hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme options, colors, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing admin passkey login requirements, issues, and feature requests."
}