{
  "backend/main.mo": "Defines product, enquiry, feedback, message, settings, and user profile types with storage, sorting helpers, and authorization mixins for admin-protected operations.",
  "feature_evidence.json": "Lists implemented admin-authentication features with associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files including pages, hooks, components, and configuration.",
  "frontend/index.css": "Defines OKLCH-based light/dark theme variables and applies Tailwind base styles for layout and theming.",
  "frontend/index.html": "Basic HTML entry point loading the React app with favicon and SEO metadata.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, themes, and all public/admin routes including guarded admin sections.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button that clears admin session and query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name with backend integration.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with logo, quick links, contact info, and a Caffeine.ai credit section.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including top navigation, content outlet, footer, WhatsApp button, and profile setup modal.",
  "frontend/src/components/layout/TopNav.tsx": "Implements a responsive top navigation bar with desktop and mobile menus, branding, nav links, and login button.",
  "frontend/src/components/whatsapp/WhatsAppFloatingButton.tsx": "Displays a floating WhatsApp button using settings to generate a prefilled chat link.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when the identity changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides admin session checks, passkey verification, and user profile fetch/save hooks using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for products, enquiries, submissions, and site settings with admin session validation.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark design tokens for the app's color system.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabbed navigation for managing products, enquiries, and site settings.",
  "frontend/src/pages/admin/AdminEnquiriesPage.tsx": "Standalone page rendering the admin enquiries panel.",
  "frontend/src/pages/admin/AdminEnquiriesPanel.tsx": "Displays all enquiries with actions to confirm or reject them using dialog prompts and mutation hooks.",
  "frontend/src/pages/admin/AdminFeedbackPage.tsx": "Fetches and displays customer feedback in a table with loading and error states.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Provides the admin dashboard layout, navigation, and page routing with logout handling.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin login flow using Internet Identity and passkey verification with redirect logic.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Shows all contact form messages in a table with loading and error handling.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Renders the admin products panel.",
  "frontend/src/pages/admin/AdminProductsPanel.tsx": "Manages product listing and creation, including file upload, form handling, and add-product mutation.",
  "frontend/src/pages/admin/AdminRouteGuard.tsx": "Protects admin routes by redirecting users who are not authenticated or unlocked.",
  "frontend/src/pages/admin/AdminSettingsPanel.tsx": "Admin settings form that loads site settings, allows editing fields like contact info, WhatsApp config, and pricing table, and saves them via updateSettings.",
  "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx": "Two‑step admin login UI handling Internet Identity login and admin passkey verification with error handling.",
  "frontend/src/pages/AdvantagesPage.tsx": "Renders a page listing HDPE pipe advantages using cards and sets the document title on mount.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form that validates input, sends messages via API, and displays company contact details.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, features, navigation buttons, and an about section.",
  "frontend/src/pages/OrderEnquiryPage.tsx": "Provides an order/enquiry form with validation, file upload handling, and submission to backend APIs.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays all products with images, details, availability status, and site certification info.",
  "frontend/src/pages/UsesApplicationsPage.tsx": "Shows various HDPE pipe applications using icon-based cards and sets the page title on mount.",
  "frontend/src/utils/adminCredentials.ts": "Empty placeholder file for admin credential utilities.",
  "frontend/src/utils/adminSession.ts": "Manages admin session state in sessionStorage with functions to set, clear, check, and subscribe to admin unlock changes.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Metadata describing project state, requirements, and issues related to implementing admin code authentication."
}