{
  "kind": "build_request",
  "title": "Restore version-10 passkey-only /admin login and fix 'Invalid passkey' regression",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the /admin unlock flow so entering the correct admin passkey \"Ved_ansh@04\" successfully unlocks the admin session (no erroneous \"Invalid passkey\" error) and grants access to all /admin routes without requiring Internet Identity login.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8",
          "msg-14"
        ],
        "quotes": [
          "it is still showing passkey as invalid",
          "there was no passkey issues in version 10 i want it like that",
          "in version 10... i just had to enter the passkey Ved_ansh@04 and i was able to login. there was no need of internet identity"
        ]
      },
      "acceptanceCriteria": [
        "When visiting /admin (or any /admin/* route) while not logged into Internet Identity, the app shows the passkey prompt and the passkey \"Ved_ansh@04\" unlocks admin access successfully.",
        "When visiting /admin (or any /admin/* route) while logged into Internet Identity, the app still allows passkey-only unlock and does not require logging out of Internet Identity to access admin.",
        "After successful unlock, navigating directly to /admin/products, /admin/enquiries, /admin/feedback, and /admin/messages works without re-entering the passkey during the same browser session.",
        "Backend calls used by admin pages (e.g., addProduct, getAllEnquiriesWithPasskey, updateSiteSettings, getAllFeedback, getAllMessages) succeed after unlock using the stored session passkey."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update frontend admin verification error handling so non-passkey failures (e.g., backend actor initialization errors, missing admin token initialization, network issues) are not misreported as \"Invalid passkey\"; show distinct, user-facing English messages for service/initialization failures.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it is still showing passkey as invalid"
        ]
      },
      "acceptanceCriteria": [
        "If admin verification fails due to service initialization or connectivity (not a backend \"Invalid passkey\" trap), the UI displays a non-passkey-specific message (e.g., \"Service unavailable. Please try again.\") instead of \"Invalid passkey\".",
        "If the backend explicitly rejects the passkey (trap includes \"Invalid passkey\"), the UI displays \"Invalid passkey\".",
        "The admin session in sessionStorage is cleared on failed verification attempts."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure admin unlock persists for the duration of the browser session and is cleared on explicit admin logout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14",
          "msg-15"
        ],
        "quotes": [
          "in version 10... i just had to enter the passkey Ved_ansh@04 and i was able to login.",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "After successful passkey verification, adminSession.isUnlocked() returns true until the browser session ends or the admin explicitly logs out.",
        "Clicking the existing \"Admin Logout\" button clears the stored admin unlock state and passkey and returns the user to a non-admin route (e.g., /).",
        "After admin logout, visiting any /admin/* route shows the passkey prompt again."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Keep Internet Identity enabled for non-admin parts of the site; do not require Internet Identity for /admin access or imply it as a prerequisite in the admin access UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-12"
        ],
        "quotes": [
          "yes not for everyone",
          "Internet Identity login is not required for admin access. Only the passkey is needed."
        ]
      },
      "acceptanceCriteria": [
        "Public pages continue to show and use Internet Identity login/logout as before.",
        "Admin access prompt continues to state that Internet Identity is not required for admin access.",
        "No /admin route redirects the user to an Internet Identity login flow to unlock admin access."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; introduce backend/migration.mo only if stable state layout changes are required.",
    "Do not edit files under frontend/src/components/ui or any other paths listed in frontend.immutablePaths (compose those components instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not remove Internet Identity from the rest of the site (non-admin users).",
    "Do not add third-party authentication providers (only Internet Identity is allowed).",
    "Do not introduce external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}