{
  "kind": "build_request",
  "title": "Fix admin passkey login so admin can view enquiries and messages",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Ensure that a successful admin passkey login actually unlocks access for all guarded admin pages (including Enquiries and Messages) by persisting the unlocked session state and redirecting to the originally requested admin route.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "when i login into admin page, i need to see enquiries and messages i get it is now showing i have no access",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "Entering the correct passkey \"vEDANSH468\" on /admin/login results in the admin session being unlocked for the current browser session (sessionStorage) and the user being redirected to the returnPath (or a sensible default).",
        "After successful login, visiting /admin/enquiries and /admin/messages does not show a 'no access' / unauthorized state due to the route guard still being locked.",
        "If the passkey is incorrect or empty, the admin session remains cleared and the user stays on the login screen with an error message."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Fix backend authorization initialization for admin-only data reads so that, after passkey unlock, admin data queries (enquiries/messages) can successfully call the backend without being blocked by missing access-control initialization.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "it is now showing i have no access"
        ]
      },
      "acceptanceCriteria": [
        "After passkey unlock, admin pages that call backend admin methods (at minimum: enquiries and messages) can load data successfully when a valid admin secret token is available via the existing caffeineAdminToken mechanism.",
        "Anonymous (non-Internet-Identity) admin sessions are still able to initialize backend access control using the existing secret-token flow, so backend calls do not fail solely because the user is not authenticated with Internet Identity.",
        "If no valid admin token is present, the UI shows a clear English error explaining that admin authorization is missing and that the admin token/passkey needs to be verified (no silent failure)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Make React Query admin data screens reliably refresh after admin unlock so that enquiries and messages appear immediately after login without requiring a manual page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "when i login into admin page, i need to see enquiries and messages i get"
        ]
      },
      "acceptanceCriteria": [
        "Immediately after a successful passkey unlock, the Enquiries and Messages admin pages load their data if the user is redirected there (no manual refresh required).",
        "Admin unlock triggers a refetch/invalidation of the relevant admin queries (at minimum: ['enquiries'] and ['messages']) so previously disabled/blocked queries can run once unlocked."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn UI components are read-only).",
    "Do not modify immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx). If changes are needed, implement them via new hooks/utilities or by adjusting non-immutable callers."
  ],
  "nonGoals": [
    "Implementing new admin features beyond fixing access (e.g., new tabs, new CRUD operations).",
    "Changing the hard-coded passkey value (must remain \"vEDANSH468\").",
    "Adding third-party authentication providers or any non-Internet-Computer auth integration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}