{
  "kind": "build_request",
  "title": "Fix failing admin passkey by rebuilding dedicated passkey-only admin login (once per session) without changing admin dashboard UI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rebuild the /admin/login flow to be passkey-only (no Internet Identity login) using the hard-coded passkey \"vEDANSH468\", and unlock admin access once per browser session via the existing sessionStorage-based admin session mechanism.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "passkey is failing\nplease fix it",
          "during entering passkey for admin login",
          "new",
          "just the passkey i am giving you vEDANSH468",
          "only passkey",
          "once per session",
          "a dedicated admin page",
          "but the admin page should be same like what it is now",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin/login shows the existing passkey prompt UI and does not trigger Internet Identity login.",
        "Entering the exact passkey \"vEDANSH468\" unlocks the admin session and redirects to the requested admin returnPath (or /admin/products when none is provided).",
        "Entering an incorrect/empty passkey shows a clear error message and does not unlock the admin session.",
        "After unlocking, refreshing the page keeps admin access until the browser session ends (sessionStorage cleared) or the user performs Admin Logout."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update admin route protection to rely only on the admin session unlock state (sessionStorage) and redirect unauthenticated admin sessions to /admin/login, while keeping all admin dashboard pages and layout unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "a dedicated admin page",
          "once per session",
          "but the admin page should be same like what it is now"
        ]
      },
      "acceptanceCriteria": [
        "When admin session is locked, navigating directly to /admin, /admin/products, /admin/enquiries, /admin/feedback, or /admin/messages redirects to /admin/login with returnPath set to the originally requested path.",
        "When admin session is unlocked, the admin routes render the current AdminLayoutPage and existing admin UI exactly as before (no layout/tab/content changes)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Refactor the admin passkey verification logic to remove the Internet Identity dependency from the passkey verification hook and ensure consistent session unlock/clear behavior (unlock on success; clear on any failure).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "only passkey",
          "new"
        ]
      },
      "acceptanceCriteria": [
        "Admin passkey verification works without requiring an Internet Identity identity to be present.",
        "On successful verification, adminSession.setUnlocked() is called and the UI proceeds to the admin dashboard.",
        "On any verification error (invalid passkey, missing actor/connection, unexpected exception), adminSession.clear() is called and the user remains on the login prompt with an error shown."
      ]
    }
  ],
  "constraints": [
    "Do not modify read-only frontend paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep the existing admin dashboard UI (AdminLayoutPage and its rendered pages) visually and structurally the same; only change authentication/gating behavior.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing or integrating third-party authentication providers (other than existing Internet Identity support).",
    "Redesigning the admin dashboard UI, navigation, or admin feature set.",
    "Adding real-time features or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}