{
  "kind": "build_request",
  "title": "Fix admin unauthorized access by adding admin code login prompt that calls authenticateAdmin(\"Ved_ansh@04\")",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the admin route guard presents a dedicated admin login screen that (1) requires the user to log in with Internet Identity and then (2) prompts for the admin code, and on submit calls the backend method authenticateAdmin(passkey) to grant the logged-in principal admin rights.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6",
          "recent-9",
          "recent-11"
        ],
        "quotes": [
          "now passkey is showing unauthorised access",
          "option 2",
          "admin code will be Ved_ansh@04"
        ]
      },
      "acceptanceCriteria": [
        "When visiting any /admin* route while logged out, the user is prompted to log in with Internet Identity first.",
        "After Internet Identity login succeeds, the UI prompts for the admin code (passkey) and does not attempt verification before a code is entered.",
        "Submitting the admin code triggers a call to authenticateAdmin(passkey).",
        "If authenticateAdmin succeeds, the admin content renders and the user can navigate to /admin/products, /admin/enquiries, /admin/feedback, and /admin/messages without seeing Unauthorized errors.",
        "If authenticateAdmin fails (e.g., wrong code), an inline error is displayed and admin content remains locked."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Use the admin code value exactly as provided (\"Ved_ansh@04\") for backend verification, and ensure frontend error handling maps backend failures (e.g., \"Invalid passkey\" / \"Unauthorized\") into clear, English error messages in the admin login screen.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-11"
        ],
        "quotes": [
          "admin code will be Ved_ansh@04"
        ]
      },
      "acceptanceCriteria": [
        "Backend authenticateAdmin rejects any passkey other than \"Ved_ansh@04\" with a clear error (e.g., \"Invalid passkey\").",
        "Frontend displays \"Invalid passkey\" when the backend rejects the code, and does not unlock the admin session on failure.",
        "Frontend displays a clear English message when the actor is not available or the user is not authenticated yet."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After successful admin authentication, persist an “admin unlocked” session flag for the current browser session and automatically clear it on admin logout and on any backend Unauthorized response from admin-only API calls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6",
          "recent-9"
        ],
        "quotes": [
          "fix it",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "After successful verification, refreshing the page during the same browser session keeps admin pages accessible without re-entering the code (until session ends or logout).",
        "Clicking “Admin Logout” clears the admin unlocked session state and returning to /admin* shows the admin login screen again.",
        "If any admin data-fetch call returns an Unauthorized error, the app clears the admin unlocked session state and returns to the admin login screen on the next admin navigation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (compose existing hooks instead of modifying them).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration logic if persisted state shape must change."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Implementing real-time updates or WebSocket-based admin data refresh.",
    "Adding new admin features unrelated to unlocking access (e.g., enquiry confirm/reject backend support)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}