{
  "kind": "build_request",
  "title": "Fix production admin login failing while draft works",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the admin passkey verification flow so it can authenticate successfully on the published (production) site, matching draft behavior, and no longer fails with the generic error \"Authentication failed. Please try again.\" when the passkey is correct.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "still i am unable to access admin page in published site although it is accessible in draft",
          "Authentication failed. Please try again.",
          "admin page"
        ]
      },
      "acceptanceCriteria": [
        "On the published site, entering the correct admin passkey unlocks admin access and navigates into the admin area (e.g., /admin/products).",
        "After successful unlock on production, calling the backend admin-only queries (e.g., enquiries/messages/products/settings) succeeds without authorization errors.",
        "The fix does not require any URL secret token (e.g., caffeineAdminToken) to be present to make admin passkey login work."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Refactor the admin passkey verification hook to avoid relying on the shared `useActor()` initialization path when performing `authenticateWithAdminPasskey`, ensuring the admin authentication call is made with a working backend actor even if actor initialization with secret-token bootstrapping fails or behaves differently in production.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "still i am unable to access admin page in published site although it is accessible in draft",
          "Authentication failed. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "Admin passkey verification (`authenticateWithAdminPasskey` followed by `isCallerAdmin`) uses an actor creation path that does not depend on any optional secret-token initialization.",
        "The admin login page shows success + redirects when the passkey is correct on production.",
        "The existing non-admin pages (Home/Products/Contact/Order) continue to function and use their existing actor/query behavior unchanged."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve admin login error reporting so that production failures are diagnosable without exposing sensitive details: log the underlying failure reason to the console with enough context (environment label, step, and a sanitized error string), and ensure the UI displays a clear English message that distinguishes invalid passkey vs connectivity vs backend rejection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Authentication failed. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "If the passkey is wrong, the UI shows \"Invalid passkey\" (or equivalent clear English) and does not show a generic authentication error.",
        "If the backend cannot be reached or the call times out, the UI shows a connectivity-focused message (e.g., instructing refresh/try again) distinct from invalid passkey.",
        "Console logs include the environment label and which step failed (local validation, actor creation/readiness, backend authenticate call, admin verification)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only introduce migration.mo if state schema changes are required.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Introducing databases or external backend services.",
    "Changing the admin passkey value unless explicitly requested by the user."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}