{
  "kind": "build_request",
  "title": "Restore admin access for enquiries and messages using shared passkey (vEDANSH468)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When a user enters the correct admin passkey on the existing admin login page, unlock full admin access across the app (including enquiries and messages) for that user session.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "all users who type correct passkey to get admin access",
          "in admin page, it is already there",
          "full admin rights",
          "vEDANSH468"
        ]
      },
      "acceptanceCriteria": [
        "Entering passkey \"vEDANSH468\" on the admin login page results in the user being treated as admin for the remainder of the browser session (until logout/session clear).",
        "After successful passkey entry, navigating to /admin/enquiries and /admin/messages loads the data instead of showing an access/permission error.",
        "Admin access applies to other admin-only operations already present (e.g., add product, update settings), not only enquiries/messages."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the regression causing \"Unauthorized\"/\"no access\" errors for admin-only backend methods by ensuring the passkey verification flow also authenticates the caller with the backend’s admin authorization mechanism.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "in version 25 now its showing u dont have access to see enquiries and messages"
        ]
      },
      "acceptanceCriteria": [
        "After successful passkey verification, the frontend calls the backend admin authentication method so that backend calls like getAllEnquiries() and getAllMessages() no longer trap with Unauthorized for that caller.",
        "If the passkey is incorrect, the admin session remains locked and backend admin authentication is not granted.",
        "If the passkey is empty/whitespace, the admin session remains locked and a user-facing error is shown (in English)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Keep the admin passkey hard-coded as \"vEDANSH468\" and do not add any UI or settings to change it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "vEDANSH468",
          "no change"
        ]
      },
      "acceptanceCriteria": [
        "The admin passkey constant remains \"vEDANSH468\".",
        "There is no admin UI to edit/rotate the passkey."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor with logic in backend/main.mo.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding role management UI (multiple roles/users) beyond the shared passkey behavior.",
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding new admin features unrelated to restoring access (e.g., new dashboards, exports, analytics)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}