{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Passkey-only admin login (sessionStorage) and admin route guarding without Internet Identity",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rebuild /admin/login to be passkey-only using hard-coded passkey and unlock admin once per browser session via sessionStorage.",
      "acceptanceCriteria": [
        "Visiting /admin/login shows the existing passkey prompt UI and does not trigger Internet Identity login.",
        "Entering the exact passkey \"vEDANSH468\" unlocks the admin session and redirects to the requested admin returnPath (or /admin/products when none is provided).",
        "Entering an incorrect/empty passkey shows a clear error message and does not unlock the admin session.",
        "After unlocking, refreshing the page keeps admin access until the browser session ends (sessionStorage cleared) or the user performs Admin Logout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Remove all Internet Identity and actor-readiness steps from the admin login flow; keep rendering the existing AdminTwoStepAccessPrompt UI, but make submit perform passkey-only verification via useVerifyAdminPasskey and on success redirect to returnPath (or /admin/products). Ensure no background login is triggered on page load and that already-unlocked sessions immediately redirect."
        },
        {
          "path": "frontend/src/utils/adminCredentials.ts",
          "operation": "modify",
          "description": "Confirm the hard-coded passkey constant remains exactly \"vEDANSH468\" and keep verification strictly local (trim + exact match) to support passkey-only admin unlock."
        },
        {
          "path": "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx",
          "operation": "modify",
          "description": "Keep UI structure unchanged; ensure user-facing error messages remain clear English for empty/invalid passkey cases and that it properly displays errors thrown by the passkey verification flow (no Internet Identity-related messaging)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update admin route protection to rely only on sessionStorage-based admin unlock state and redirect locked sessions to /admin/login with returnPath.",
      "acceptanceCriteria": [
        "When admin session is locked, navigating directly to /admin, /admin/products, /admin/enquiries, /admin/feedback, or /admin/messages redirects to /admin/login with returnPath set to the originally requested path.",
        "When admin session is unlocked, the admin routes render the current AdminLayoutPage and existing admin UI exactly as before (no layout/tab/content changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Refactor the guard to depend only on adminSession.isUnlocked() (sessionStorage) and its subscribe notifications; remove Internet Identity dependency and initialization gating. When locked, redirect to /admin/login with returnPath=location.pathname; when unlocked, render children without altering AdminLayoutPage or admin page UI."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify all admin routes (/admin, /admin/products, /admin/enquiries, /admin/feedback, /admin/messages) remain wrapped by AdminRouteGuard and that /admin/login remains unguarded; keep route structure and AdminLayoutPage usage unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Refactor admin passkey verification hook to remove Internet Identity dependency and enforce consistent session unlock/clear behavior.",
      "acceptanceCriteria": [
        "Admin passkey verification works without requiring an Internet Identity identity to be present.",
        "On successful verification, adminSession.setUnlocked() is called and the UI proceeds to the admin dashboard.",
        "On any verification error (invalid passkey, missing actor/connection, unexpected exception), adminSession.clear() is called and the user remains on the login prompt with an error shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuthz.ts",
          "operation": "modify",
          "description": "Rewrite useVerifyAdminPasskey to be passkey-only: remove Internet Identity and actor/back-end authenticateAdmin dependency; validate input (trim, non-empty), verify via verifyPasskey, and call adminSession.setUnlocked() on success. On any failure/exception, call adminSession.clear() and throw an English error suitable for AdminTwoStepAccessPrompt to display."
        },
        {
          "path": "frontend/src/utils/adminSession.ts",
          "operation": "modify",
          "description": "Ensure adminSession behavior is consistent and idempotent for unlock/clear/logout and continues to notify subscribers on state changes, supporting 'unlock once per session' semantics via sessionStorage."
        }
      ]
    }
  ]
}