{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin unlock flow: dedicated admin login screen + passkey verification + session persistence",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a dedicated admin login screen that enforces Internet Identity login first, then prompts for admin code and calls authenticateAdmin(passkey) to unlock /admin* routes.",
      "acceptanceCriteria": [
        "When visiting any /admin* route while logged out, the user is prompted to log in with Internet Identity first.",
        "After Internet Identity login succeeds, the UI prompts for the admin code (passkey) and does not attempt verification before a code is entered.",
        "Submitting the admin code triggers a call to authenticateAdmin(passkey).",
        "If authenticateAdmin succeeds, the admin content renders and the user can navigate to /admin/products, /admin/enquiries, /admin/feedback, and /admin/messages without seeing Unauthorized errors.",
        "If authenticateAdmin fails (e.g., wrong code), an inline error is displayed and admin content remains locked."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "create",
          "description": "Create a dedicated Admin Login page that renders the existing AdminTwoStepAccessPrompt (shadcn-ui components are already used inside it; do not edit frontend/src/components/ui). The page should: (a) require Internet Identity login first, (b) then allow passkey entry, and (c) on submit call authenticateAdmin(passkey) via existing auth hooks. Use the authorization component’s frontend guidance (Internet Identity-first gating and graceful auth error handling) to structure the flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Update the admin route guard to redirect unauthorized users to the dedicated admin login screen (e.g., /admin/login) while preserving the originally requested /admin* path for post-unlock navigation. Ensure admin content only renders when (1) Internet Identity is authenticated and (2) the admin session is unlocked. Use the authorization component’s frontend guidance for enforcing login before restricted data is shown. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new /admin/login route into the router so it is reachable as the dedicated admin login screen, and ensure /admin, /admin/products, /admin/enquiries, /admin/feedback, and /admin/messages remain protected by AdminRouteGuard (and do not create orphaned pages)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure passkey verification expects the exact code value for backend verification and map backend failures into clear English errors on the admin login screen.",
      "acceptanceCriteria": [
        "Backend authenticateAdmin rejects any passkey other than \"Ved_ansh@04\" with a clear error (e.g., \"Invalid passkey\").",
        "Frontend displays \"Invalid passkey\" when the backend rejects the code, and does not unlock the admin session on failure.",
        "Frontend displays a clear English message when the actor is not available or the user is not authenticated yet."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuthz.ts",
          "operation": "modify",
          "description": "Refine useVerifyAdminPasskey error handling so backend failures map to clear, English messages suitable for the admin login screen: show \"Invalid passkey\" on invalid-code failures (the correct code is exactly \"Ved_ansh@04\"), show a clear message for \"Unauthorized\" responses, and show a clear message when the actor is not available / user is not authenticated yet. Ensure failures never set the unlocked session flag. Use the authorization component’s frontend error-handling guidance for authorization traps and unauthenticated states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx",
          "operation": "modify",
          "description": "Update the prompt UI to display the refined, user-friendly error messages coming from the auth hook (inline) and ensure it never attempts verification before a non-empty passkey is entered. Keep using existing shadcn/ui components without modifying frontend/src/components/ui (read-only)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Persist an admin-unlocked flag for the browser session and clear it on admin logout and on any Unauthorized response from admin-only API calls.",
      "acceptanceCriteria": [
        "After successful verification, refreshing the page during the same browser session keeps admin pages accessible without re-entering the code (until session ends or logout).",
        "Clicking “Admin Logout” clears the admin unlocked session state and returning to /admin* shows the admin login screen again.",
        "If any admin data-fetch call returns an Unauthorized error, the app clears the admin unlocked session state and returns to the admin login screen on the next admin navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/adminSession.ts",
          "operation": "modify",
          "description": "Harden the sessionStorage-backed admin unlocked utilities to support consistent clearing and notification semantics used across the app (unlock persists for the browser session; clear on logout and unauthorized)."
        },
        {
          "path": "frontend/src/pages/admin/AdminLayoutPage.tsx",
          "operation": "modify",
          "description": "Ensure “Admin Logout” clears the admin unlocked session state and routes the user to the dedicated admin login screen (or otherwise guarantees the next /admin* navigation shows the login screen), matching the required behavior."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Standardize admin-only React Query hooks/mutations to clear the admin unlocked session state on any backend \"Unauthorized\" failure and ensure subsequent admin navigations return to the admin login screen (the guard should enforce this)."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Confirm Internet Identity logout clears the admin unlocked session state for the current browser session and clears cached admin data (query cache) so admin pages remain locked until re-unlocked."
        }
      ]
    }
  ]
}