{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore admin access for enquiries/messages via shared passkey and backend admin authentication",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Unlock admin access for the browser session after correct passkey entry, enabling navigation to all admin pages including enquiries and messages.",
      "acceptanceCriteria": [
        "Entering passkey \"vEDANSH468\" on the admin login page results in the user being treated as admin for the remainder of the browser session (until logout/session clear).",
        "After successful passkey entry, navigating to /admin/enquiries and /admin/messages loads the data instead of showing an access/permission error.",
        "Admin access applies to other admin-only operations already present (e.g., add product, update settings), not only enquiries/messages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuthz.ts",
          "operation": "modify",
          "description": "Update the passkey verification mutation to unlock the frontend admin session only after successful backend-side admin authentication, so all admin-only reads/writes (enquiries/messages/products/settings) work for the remainder of the session. Use the selected \"authorization\" component’s backend-backed admin mechanism via the existing backendInterface.authenticateAdmin(passkey) call (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Ensure the existing admin login flow redirects only after the updated verification/authentication completes successfully, preserving return-path behavior for /admin/enquiries and /admin/messages."
        },
        {
          "path": "frontend/src/pages/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Confirm the guard continues to rely on the session unlock state and cleanly redirects locked sessions to /admin/login with the stored return path, ensuring admin pages are not accessible until unlock."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix Unauthorized errors by calling backend admin authentication after passkey verification, and enforce correct error handling for empty/invalid passkeys.",
      "acceptanceCriteria": [
        "After successful passkey verification, the frontend calls the backend admin authentication method so that backend calls like getAllEnquiries() and getAllMessages() no longer trap with Unauthorized for that caller.",
        "If the passkey is incorrect, the admin session remains locked and backend admin authentication is not granted.",
        "If the passkey is empty/whitespace, the admin session remains locked and a user-facing error is shown (in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuthz.ts",
          "operation": "modify",
          "description": "Implement the regression fix: after locally validating the passkey, require an authenticated Internet Identity session and call actor.authenticateAdmin(trimmedPasskey). Only set adminSession unlocked after this call succeeds; on any failure, clear adminSession and surface English errors. This integrates with the selected \"authorization\" component’s admin authorization flow (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/admin/AdminTwoStepAccessPrompt.tsx",
          "operation": "modify",
          "description": "Adjust the prompt UX to support the new backend-authenticated flow: display a clear English error when passkey is empty/whitespace, and (if needed) show an English message that the user must be logged in with Internet Identity before admin access can be granted."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align admin query error messages with the backend-authenticated admin flow: keep English user-facing messages, and ensure Unauthorized-like failures instruct the user to log in and verify the passkey without exposing internal details."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep the shared admin passkey hard-coded as vEDANSH468 with no UI/settings to change it.",
      "acceptanceCriteria": [
        "The admin passkey constant remains \"vEDANSH468\".",
        "There is no admin UI to edit/rotate the passkey."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/adminCredentials.ts",
          "operation": "modify",
          "description": "Ensure the hard-coded ADMIN_PASSKEY remains exactly \"vEDANSH468\" and is only used for local verification; do not add any functionality or exports that would enable editing/rotating the passkey via UI or settings."
        }
      ]
    }
  ]
}