{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build a dedicated admin page login gate using a hard-coded passkey (vEDANSH468), required once per session, while keeping the existing admin page UI unchanged.",
  "architectural_notes": [
    "Admin authentication is a single hard-coded passkey (vEDANSH468), validated once per session, gating access to the existing admin page without changing its UI."
  ],
  "known_issues": [
    "Current passkey flow fails during passkey entry for admin login (Version 21)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-rebuild-the-admin-login-flow-to-be-passkey-only-no-internet-identity-login-using-the-hard-coded-passkey-vedansh468-and-unlock-admin-access-once-per-browser-session-via-the-existing-sessionstorage-based-admin-session-mechanism",
      "title": "Rebuild the /admin/login flow to be passkey-only (no Internet Identity login) using the hard-coded passkey \"vEDANSH468\", and unlock admin access once per browser session via the existing sessionStorage-based admin session mechanism.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-admin-route-protection-to-rely-only-on-the-admin-session-unlock-state-sessionstorage-and-redirect-unauthenticated-admin-sessions-to-admin-login-while-keeping-all-admin-dashboard-pages-and-layout-unchanged",
      "title": "Update admin route protection to rely only on the admin session unlock state (sessionStorage) and redirect unauthenticated admin sessions to /admin/login, while keeping all admin dashboard pages and layout unchanged.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-refactor-the-admin-passkey-verification-logic-to-remove-the-internet-identity-dependency-from-the-passkey-verification-hook-and-ensure-consistent-session-unlock-clear-behavior-unlock-on-success-clear-on-any-failure",
      "title": "Refactor the admin passkey verification logic to remove the Internet Identity dependency from the passkey verification hook and ensure consistent session unlock/clear behavior (unlock on success; clear on any failure).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Rebuild admin login using hard-coded passkey \"vEDANSH468\" on a dedicated admin page; require passkey once per session; keep existing admin page UI unchanged",
      "reqIds": [],
      "status": "in_progress"
    }
  ],
  "projectName": "Fix failing admin passkey by rebuilding dedicated passkey-only admin login (once per session) without changing admin dashboard UI",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}