{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "App with admin access via a shared passkey on the admin page; Version 25 has an access regression blocking enquiries/messages and needs restoration of full admin rights when the correct passkey is entered.",
  "architectural_notes": [
    "Admin access is granted via a single shared passkey entered on the existing admin page; correct passkey unlocks full admin rights across the app.",
    "Admin passkey is hard-coded to \"vEDANSH468\" (no in-app change mechanism)."
  ],
  "known_issues": [
    "Version 25 shows \"you don't have access to see enquiries and messages\" even for intended admin users (regression in admin access control)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-when-a-user-enters-the-correct-admin-passkey-on-the-existing-admin-login-page-unlock-full-admin-access-across-the-app-including-enquiries-and-messages-for-that-user-session",
      "title": "When a user enters the correct admin passkey on the existing admin login page, unlock full admin access across the app (including enquiries and messages) for that user session.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-the-regression-causing-unauthorized-no-access-errors-for-admin-only-backend-methods-by-ensuring-the-passkey-verification-flow-also-authenticates-the-caller-with-the-backend-s-admin-authorization-mechanism",
      "title": "Fix the regression causing \"Unauthorized\"/\"no access\" errors for admin-only backend methods by ensuring the passkey verification flow also authenticates the caller with the backend’s admin authorization mechanism.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Restore full admin access (including enquiries/messages) for all users who enter the correct admin passkey on the admin page; passkey is hard-coded to vEDANSH468.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Keep the admin passkey hard-coded as \"vEDANSH468\" and do not add any UI or settings to change it.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Restore admin access for enquiries and messages using shared passkey (vEDANSH468)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}